
import numpy as np

# Создать матрицу, найти максимальное
# значение матрицы.

matrix = np.array([[1,2,3],[3,4,3]])
print(matrix.max())